In [1]:
%load_ext sql

In [2]:
%reload_ext sql

In [3]:
%sql sqlite://

#### Q-1. Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as &lt;WORKER_NAME&gt;.

In [5]:
%%sql
CREATE TABLE WORKER(FIRST_NAME VARCHAR(50),LAST_NAME VARCHAR(50),DEPARTMENT VARCHAR(50))

 * sqlite://
Done.

[]

In [6]:
%%sql
INSERT INTO WORKER VALUES("NARAYANA",'REDDY','HR');
INSERT INTO WORKER VALUES("VENKATA",'REDDY','FINACE');
INSERT INTO WORKER VALUES("VENKY",'SANI','MARKETING');
INSERT INTO WORKER VALUES("BABU",'REDDY','MARKETING');
INSERT INTO WORKER VALUES("NANI",'REDDY','TECHNOLOGY');
INSERT INTO WORKER VALUES("NARASIMHA",'REDDY','HR');
INSERT INTO WORKER VALUES("NAVEEN",'REDDY','HR');
INSERT INTO WORKER VALUES("PRASAD",'REDDY','FINACE');
INSERT INTO WORKER VALUES("AKILA",'REDDY','FINACE');
INSERT INTO WORKER VALUES("BABU",'REDDY','TECHNOLOGY');
INSERT INTO WORKER VALUES("MANI",'REDDY','TECHNOLOGY');
INSERT INTO WORKER VALUES("ANJI",'REDDY','GENERAL');
INSERT INTO WORKER VALUES("ANJALI",'REDDY','GENERAL');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
select FIRST_NAME as WORKER_NAME from worker

 * sqlite://
Done.

[('NARAYANA',),
 ('VENKATA',),
 ('VENKY',),
 ('BABU',),
 ('NANI',),
 ('NARASIMHA',),
 ('NAVEEN',),
 ('PRASAD',),
 ('AKILA',),
 ('BABU',),
 ('MANI',),
 ('ANJI',),
 ('ANJALI',)]

#### Q-2. Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [8]:
%%sql
select distinct department from worker

 * sqlite://
Done.

[('HR',), ('FINACE',), ('MARKETING',), ('TECHNOLOGY',), ('GENERAL',)]

#### Q-3. Write an SQL query to show the last 5 record from a table.

In [27]:
%%sql
select * from worker order by FIRST_NAME DESC LIMIT 5

 * sqlite://
Done.

[('VENKY', 'SANI', 'MARKETING'),
 ('VENKATA', 'REDDY', 'FINACE'),
 ('PRASAD', 'REDDY', 'FINACE'),
 ('NAVEEN', 'REDDY', 'HR'),
 ('NARAYANA', 'REDDY', 'HR')]